app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'imagehawaii.jpg', 46, 11, '2018-12-08 07:42:44', '2018-12-08 07:42:44')
---
json.user_name  @message.user.name
json.data @message.created_at.strftime('%Y年%m月%d日 %H:%M:%S')