app/controllers/groups_controller.rb

INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2018-12-04 09:09:39', '2018-12-04 09:09:39')
---
  def new
    @group = Group.new
    @group.users << current_user

UPDATE `groups` SET `name` = 'a', `updated_at` = '2018-12-06 09:40:42' WHERE `groups`.`id` = 21
---
  def update
    if @group.update(group_params)