app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name LIKE('%あ%') && name != current_user.name)
---
  def index
    @users = User.where("name LIKE(?) && id != #{current_user.id}", "%#{params[:keyword]}%")